GopalSaraf/Practicals/PSDL/include/proc/pic18f26q43.h
// Register: I2C1BTO
#define I2C1BTO I2C1BTO
extern volatile unsigned char           I2C1BTO             __at(0x29D);
#ifndef _LIB_BUILD
asm("I2C1BTO equ 029Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTO                    :8;
    };
    struct {
        unsigned I2CBTO                 :8;
    };
    struct {
        unsigned BTO0                   :1;
        unsigned BTO1                   :1;
        unsigned BTO2                   :1;
        unsigned BTO3                   :1;
    };
    struct {
        unsigned I2CBTO0                :1;
        unsigned I2CBTO1                :1;
        unsigned I2CBTO2                :1;
        unsigned I2CBTO3                :1;
    };
} I2C1BTObits_t;
extern volatile I2C1BTObits_t I2C1BTObits __at(0x29D);
// bitfield macros
#define _I2C1BTO_BTO_POSN                                   0x0
#define _I2C1BTO_BTO_POSITION                               0x0
#define _I2C1BTO_BTO_SIZE                                   0x8
#define _I2C1BTO_BTO_LENGTH                                 0x8
#define _I2C1BTO_BTO_MASK                                   0xFF
#define _I2C1BTO_I2CBTO_POSN                                0x0
#define _I2C1BTO_I2CBTO_POSITION                            0x0
#define _I2C1BTO_I2CBTO_SIZE                                0x8
#define _I2C1BTO_I2CBTO_LENGTH                              0x8
#define _I2C1BTO_I2CBTO_MASK                                0xFF
#define _I2C1BTO_BTO0_POSN                                  0x0
#define _I2C1BTO_BTO0_POSITION                              0x0
#define _I2C1BTO_BTO0_SIZE                                  0x1
#define _I2C1BTO_BTO0_LENGTH                                0x1
#define _I2C1BTO_BTO0_MASK                                  0x1
#define _I2C1BTO_BTO1_POSN                                  0x1
#define _I2C1BTO_BTO1_POSITION                              0x1
#define _I2C1BTO_BTO1_SIZE                                  0x1
#define _I2C1BTO_BTO1_LENGTH                                0x1
#define _I2C1BTO_BTO1_MASK                                  0x2
#define _I2C1BTO_BTO2_POSN                                  0x2
#define _I2C1BTO_BTO2_POSITION                              0x2
#define _I2C1BTO_BTO2_SIZE                                  0x1
#define _I2C1BTO_BTO2_LENGTH                                0x1
#define _I2C1BTO_BTO2_MASK                                  0x4
#define _I2C1BTO_BTO3_POSN                                  0x3
#define _I2C1BTO_BTO3_POSITION                              0x3
#define _I2C1BTO_BTO3_SIZE                                  0x1
#define _I2C1BTO_BTO3_LENGTH                                0x1
#define _I2C1BTO_BTO3_MASK                                  0x8
#define _I2C1BTO_I2CBTO0_POSN                               0x0
#define _I2C1BTO_I2CBTO0_POSITION                           0x0
#define _I2C1BTO_I2CBTO0_SIZE                               0x1
#define _I2C1BTO_I2CBTO0_LENGTH                             0x1
#define _I2C1BTO_I2CBTO0_MASK                               0x1
#define _I2C1BTO_I2CBTO1_POSN                               0x1
#define _I2C1BTO_I2CBTO1_POSITION                           0x1
#define _I2C1BTO_I2CBTO1_SIZE                               0x1
#define _I2C1BTO_I2CBTO1_LENGTH                             0x1
#define _I2C1BTO_I2CBTO1_MASK                               0x2
#define _I2C1BTO_I2CBTO2_POSN                               0x2
#define _I2C1BTO_I2CBTO2_POSITION                           0x2
#define _I2C1BTO_I2CBTO2_SIZE                               0x1
#define _I2C1BTO_I2CBTO2_LENGTH                             0x1
#define _I2C1BTO_I2CBTO2_MASK                               0x4
#define _I2C1BTO_I2CBTO3_POSN                               0x3
#define _I2C1BTO_I2CBTO3_POSITION                           0x3
#define _I2C1BTO_I2CBTO3_SIZE                               0x1
#define _I2C1BTO_I2CBTO3_LENGTH                             0x1
#define _I2C1BTO_I2CBTO3_MASK                               0x8

// Register: U1RXB
#define U1RXB U1RXB
extern volatile unsigned char           U1RXB               __at(0x2A1);
#ifndef _LIB_BUILD
asm("U1RXB equ 02A1h");
#endif
// aliases
extern volatile unsigned char           U1RXBL              __at(0x2A1);
#ifndef _LIB_BUILD
asm("U1RXBL equ 02A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U1RXBbits_t;
extern volatile U1RXBbits_t U1RXBbits __at(0x2A1);
// bitfield macros
#define _U1RXB_RXB_POSN                                     0x0
#define _U1RXB_RXB_POSITION                                 0x0
#define _U1RXB_RXB_SIZE                                     0x8
#define _U1RXB_RXB_LENGTH                                   0x8
#define _U1RXB_RXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U1RXBLbits_t;
extern volatile U1RXBLbits_t U1RXBLbits __at(0x2A1);
// bitfield macros
#define _U1RXBL_RXB_POSN                                    0x0
#define _U1RXBL_RXB_POSITION                                0x0
#define _U1RXBL_RXB_SIZE                                    0x8
#define _U1RXBL_RXB_LENGTH                                  0x8
#define _U1RXBL_RXB_MASK                                    0xFF

// Register: U1RXCHK
#define U1RXCHK U1RXCHK
extern volatile unsigned char           U1RXCHK             __at(0x2A2);
#ifndef _LIB_BUILD
asm("U1RXCHK equ 02A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXCHK                  :8;
    };
} U1RXCHKbits_t;
extern volatile U1RXCHKbits_t U1RXCHKbits __at(0x2A2);
// bitfield macros
#define _U1RXCHK_RXCHK_POSN                                 0x0
#define _U1RXCHK_RXCHK_POSITION                             0x0
#define _U1RXCHK_RXCHK_SIZE                                 0x8
#define _U1RXCHK_RXCHK_LENGTH                               0x8
#define _U1RXCHK_RXCHK_MASK                                 0xFF

