GopalSaraf/Practicals/PSDL/include/proc/pic18f26q43.h
extern volatile __bit                   NACK1IF             __at(0x14BC);	// @ (0x297 * 8 + 4)
#define                                 NACK1IF_bit         _BIT_ACCESS(I2C1ERR,4)
// I2C1ERR<NACKIE>
extern volatile __bit                   NACKIE              __at(0x14B8);	// @ (0x297 * 8 + 0)
#define                                 NACKIE_bit          _BIT_ACCESS(I2C1ERR,0)
// I2C1ERR<NACKIF>
extern volatile __bit                   NACKIF              __at(0x14BC);	// @ (0x297 * 8 + 4)
#define                                 NACKIF_bit          _BIT_ACCESS(I2C1ERR,4)
// NCO1ACCL<NCO1ACC0>
extern volatile __bit                   NCO1ACC0            __at(0x2200);	// @ (0x440 * 8 + 0)
#define                                 NCO1ACC0_bit        _BIT_ACCESS(NCO1ACCL,0)
// NCO1ACCL<NCO1ACC1>
extern volatile __bit                   NCO1ACC1            __at(0x2201);	// @ (0x440 * 8 + 1)
#define                                 NCO1ACC1_bit        _BIT_ACCESS(NCO1ACCL,1)
// NCO1ACCH<NCO1ACC10>
extern volatile __bit                   NCO1ACC10           __at(0x220A);	// @ (0x441 * 8 + 2)
#define                                 NCO1ACC10_bit       _BIT_ACCESS(NCO1ACCH,2)
// NCO1ACCH<NCO1ACC11>
extern volatile __bit                   NCO1ACC11           __at(0x220B);	// @ (0x441 * 8 + 3)
#define                                 NCO1ACC11_bit       _BIT_ACCESS(NCO1ACCH,3)
// NCO1ACCH<NCO1ACC12>
extern volatile __bit                   NCO1ACC12           __at(0x220C);	// @ (0x441 * 8 + 4)
#define                                 NCO1ACC12_bit       _BIT_ACCESS(NCO1ACCH,4)
// NCO1ACCH<NCO1ACC13>
extern volatile __bit                   NCO1ACC13           __at(0x220D);	// @ (0x441 * 8 + 5)
#define                                 NCO1ACC13_bit       _BIT_ACCESS(NCO1ACCH,5)
// NCO1ACCH<NCO1ACC14>
extern volatile __bit                   NCO1ACC14           __at(0x220E);	// @ (0x441 * 8 + 6)
#define                                 NCO1ACC14_bit       _BIT_ACCESS(NCO1ACCH,6)
// NCO1ACCH<NCO1ACC15>
extern volatile __bit                   NCO1ACC15           __at(0x220F);	// @ (0x441 * 8 + 7)
#define                                 NCO1ACC15_bit       _BIT_ACCESS(NCO1ACCH,7)
// NCO1ACCU<NCO1ACC16>
extern volatile __bit                   NCO1ACC16           __at(0x2210);	// @ (0x442 * 8 + 0)
#define                                 NCO1ACC16_bit       _BIT_ACCESS(NCO1ACCU,0)
// NCO1ACCU<NCO1ACC17>
extern volatile __bit                   NCO1ACC17           __at(0x2211);	// @ (0x442 * 8 + 1)
#define                                 NCO1ACC17_bit       _BIT_ACCESS(NCO1ACCU,1)
// NCO1ACCU<NCO1ACC18>
extern volatile __bit                   NCO1ACC18           __at(0x2212);	// @ (0x442 * 8 + 2)
#define                                 NCO1ACC18_bit       _BIT_ACCESS(NCO1ACCU,2)
// NCO1ACCU<NCO1ACC19>
extern volatile __bit                   NCO1ACC19           __at(0x2213);	// @ (0x442 * 8 + 3)
#define                                 NCO1ACC19_bit       _BIT_ACCESS(NCO1ACCU,3)
// NCO1ACCL<NCO1ACC2>
extern volatile __bit                   NCO1ACC2            __at(0x2202);	// @ (0x440 * 8 + 2)
#define                                 NCO1ACC2_bit        _BIT_ACCESS(NCO1ACCL,2)
// NCO1ACCL<NCO1ACC3>
extern volatile __bit                   NCO1ACC3            __at(0x2203);	// @ (0x440 * 8 + 3)
#define                                 NCO1ACC3_bit        _BIT_ACCESS(NCO1ACCL,3)
// NCO1ACCL<NCO1ACC4>
extern volatile __bit                   NCO1ACC4            __at(0x2204);	// @ (0x440 * 8 + 4)
#define                                 NCO1ACC4_bit        _BIT_ACCESS(NCO1ACCL,4)
// NCO1ACCL<NCO1ACC5>
extern volatile __bit                   NCO1ACC5            __at(0x2205);	// @ (0x440 * 8 + 5)
#define                                 NCO1ACC5_bit        _BIT_ACCESS(NCO1ACCL,5)
// NCO1ACCL<NCO1ACC6>
extern volatile __bit                   NCO1ACC6            __at(0x2206);	// @ (0x440 * 8 + 6)
#define                                 NCO1ACC6_bit        _BIT_ACCESS(NCO1ACCL,6)
// NCO1ACCL<NCO1ACC7>
extern volatile __bit                   NCO1ACC7            __at(0x2207);	// @ (0x440 * 8 + 7)
#define                                 NCO1ACC7_bit        _BIT_ACCESS(NCO1ACCL,7)
// NCO1ACCH<NCO1ACC8>
extern volatile __bit                   NCO1ACC8            __at(0x2208);	// @ (0x441 * 8 + 0)
#define                                 NCO1ACC8_bit        _BIT_ACCESS(NCO1ACCH,0)
// NCO1ACCH<NCO1ACC9>
extern volatile __bit                   NCO1ACC9            __at(0x2209);	// @ (0x441 * 8 + 1)
#define                                 NCO1ACC9_bit        _BIT_ACCESS(NCO1ACCH,1)
// NCO1CLK<NCO1CKS0>
extern volatile __bit                   NCO1CKS0            __at(0x2238);	// @ (0x447 * 8 + 0)
#define                                 NCO1CKS0_bit        _BIT_ACCESS(NCO1CLK,0)
// NCO1CLK<NCO1CKS1>
extern volatile __bit                   NCO1CKS1            __at(0x2239);	// @ (0x447 * 8 + 1)
#define                                 NCO1CKS1_bit        _BIT_ACCESS(NCO1CLK,1)
// NCO1CLK<NCO1CKS2>
extern volatile __bit                   NCO1CKS2            __at(0x223A);	// @ (0x447 * 8 + 2)
#define                                 NCO1CKS2_bit        _BIT_ACCESS(NCO1CLK,2)
// NCO1CLK<NCO1CKS3>
extern volatile __bit                   NCO1CKS3            __at(0x223B);	// @ (0x447 * 8 + 3)
#define                                 NCO1CKS3_bit        _BIT_ACCESS(NCO1CLK,3)
// NCO1CLK<NCO1CKS4>
extern volatile __bit                   NCO1CKS4            __at(0x223C);	// @ (0x447 * 8 + 4)
#define                                 NCO1CKS4_bit        _BIT_ACCESS(NCO1CLK,4)
// NCO1CON<NCO1EN>
extern volatile __bit                   NCO1EN              __at(0x2237);	// @ (0x446 * 8 + 7)
#define                                 NCO1EN_bit          _BIT_ACCESS(NCO1CON,7)
// PIE6<NCO1IE>
extern volatile __bit                   NCO1IE              __at(0x2523);	// @ (0x4A4 * 8 + 3)
#define                                 NCO1IE_bit          _BIT_ACCESS(PIE6,3)
// PIR6<NCO1IF>
extern volatile __bit                   NCO1IF              __at(0x25A3);	// @ (0x4B4 * 8 + 3)
#define                                 NCO1IF_bit          _BIT_ACCESS(PIR6,3)
// NCO1INCL<NCO1INC0>
extern volatile __bit                   NCO1INC0            __at(0x2218);	// @ (0x443 * 8 + 0)
#define                                 NCO1INC0_bit        _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<NCO1INC1>
extern volatile __bit                   NCO1INC1            __at(0x2219);	// @ (0x443 * 8 + 1)
#define                                 NCO1INC1_bit        _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<NCO1INC10>
extern volatile __bit                   NCO1INC10           __at(0x2222);	// @ (0x444 * 8 + 2)
#define                                 NCO1INC10_bit       _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<NCO1INC11>
extern volatile __bit                   NCO1INC11           __at(0x2223);	// @ (0x444 * 8 + 3)
#define                                 NCO1INC11_bit       _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<NCO1INC12>
extern volatile __bit                   NCO1INC12           __at(0x2224);	// @ (0x444 * 8 + 4)
#define                                 NCO1INC12_bit       _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<NCO1INC13>
extern volatile __bit                   NCO1INC13           __at(0x2225);	// @ (0x444 * 8 + 5)
#define                                 NCO1INC13_bit       _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<NCO1INC14>
extern volatile __bit                   NCO1INC14           __at(0x2226);	// @ (0x444 * 8 + 6)
#define                                 NCO1INC14_bit       _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<NCO1INC15>
extern volatile __bit                   NCO1INC15           __at(0x2227);	// @ (0x444 * 8 + 7)
#define                                 NCO1INC15_bit       _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<NCO1INC16>
extern volatile __bit                   NCO1INC16           __at(0x2228);	// @ (0x445 * 8 + 0)
#define                                 NCO1INC16_bit       _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<NCO1INC17>
extern volatile __bit                   NCO1INC17           __at(0x2229);	// @ (0x445 * 8 + 1)
#define                                 NCO1INC17_bit       _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<NCO1INC18>
extern volatile __bit                   NCO1INC18           __at(0x222A);	// @ (0x445 * 8 + 2)
#define                                 NCO1INC18_bit       _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<NCO1INC19>
extern volatile __bit                   NCO1INC19           __at(0x222B);	// @ (0x445 * 8 + 3)
#define                                 NCO1INC19_bit       _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<NCO1INC2>
extern volatile __bit                   NCO1INC2            __at(0x221A);	// @ (0x443 * 8 + 2)
#define                                 NCO1INC2_bit        _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<NCO1INC3>
extern volatile __bit                   NCO1INC3            __at(0x221B);	// @ (0x443 * 8 + 3)
#define                                 NCO1INC3_bit        _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<NCO1INC4>
extern volatile __bit                   NCO1INC4            __at(0x221C);	// @ (0x443 * 8 + 4)
#define                                 NCO1INC4_bit        _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<NCO1INC5>
extern volatile __bit                   NCO1INC5            __at(0x221D);	// @ (0x443 * 8 + 5)
#define                                 NCO1INC5_bit        _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<NCO1INC6>
extern volatile __bit                   NCO1INC6            __at(0x221E);	// @ (0x443 * 8 + 6)
#define                                 NCO1INC6_bit        _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<NCO1INC7>
extern volatile __bit                   NCO1INC7            __at(0x221F);	// @ (0x443 * 8 + 7)
#define                                 NCO1INC7_bit        _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<NCO1INC8>
extern volatile __bit                   NCO1INC8            __at(0x2220);	// @ (0x444 * 8 + 0)
#define                                 NCO1INC8_bit        _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<NCO1INC9>
extern volatile __bit                   NCO1INC9            __at(0x2221);	// @ (0x444 * 8 + 1)
#define                                 NCO1INC9_bit        _BIT_ACCESS(NCO1INCH,1)
// IPR6<NCO1IP>
extern volatile __bit                   NCO1IP              __at(0x1B43);	// @ (0x368 * 8 + 3)
#define                                 NCO1IP_bit          _BIT_ACCESS(IPR6,3)
// PMD4<NCO1MD>
extern volatile __bit                   NCO1MD              __at(0x320);	// @ (0x64 * 8 + 0)
#define                                 NCO1MD_bit          _BIT_ACCESS(PMD4,0)
// NCO1CON<NCO1OUT>
extern volatile __bit                   NCO1OUT             __at(0x2235);	// @ (0x446 * 8 + 5)
#define                                 NCO1OUT_bit         _BIT_ACCESS(NCO1CON,5)
// NCO1CON<NCO1PFM>
extern volatile __bit                   NCO1PFM             __at(0x2230);	// @ (0x446 * 8 + 0)
#define                                 NCO1PFM_bit         _BIT_ACCESS(NCO1CON,0)
// NCO1CON<NCO1POL>
extern volatile __bit                   NCO1POL             __at(0x2234);	// @ (0x446 * 8 + 4)
#define                                 NCO1POL_bit         _BIT_ACCESS(NCO1CON,4)
// NCO1CLK<NCO1PWS0>
extern volatile __bit                   NCO1PWS0            __at(0x223D);	// @ (0x447 * 8 + 5)
#define                                 NCO1PWS0_bit        _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<NCO1PWS1>
extern volatile __bit                   NCO1PWS1            __at(0x223E);	// @ (0x447 * 8 + 6)
#define                                 NCO1PWS1_bit        _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<NCO1PWS2>
extern volatile __bit                   NCO1PWS2            __at(0x223F);	// @ (0x447 * 8 + 7)
#define                                 NCO1PWS2_bit        _BIT_ACCESS(NCO1CLK,7)
// NCO2ACCL<NCO2ACC0>
extern volatile __bit                   NCO2ACC0            __at(0x2240);	// @ (0x448 * 8 + 0)
#define                                 NCO2ACC0_bit        _BIT_ACCESS(NCO2ACCL,0)
// NCO2ACCL<NCO2ACC1>
extern volatile __bit                   NCO2ACC1            __at(0x2241);	// @ (0x448 * 8 + 1)
#define                                 NCO2ACC1_bit        _BIT_ACCESS(NCO2ACCL,1)
// NCO2ACCH<NCO2ACC10>
extern volatile __bit                   NCO2ACC10           __at(0x224A);	// @ (0x449 * 8 + 2)
#define                                 NCO2ACC10_bit       _BIT_ACCESS(NCO2ACCH,2)
// NCO2ACCH<NCO2ACC11>
extern volatile __bit                   NCO2ACC11           __at(0x224B);	// @ (0x449 * 8 + 3)
#define                                 NCO2ACC11_bit       _BIT_ACCESS(NCO2ACCH,3)
// NCO2ACCH<NCO2ACC12>
extern volatile __bit                   NCO2ACC12           __at(0x224C);	// @ (0x449 * 8 + 4)
#define                                 NCO2ACC12_bit       _BIT_ACCESS(NCO2ACCH,4)
// NCO2ACCH<NCO2ACC13>
extern volatile __bit                   NCO2ACC13           __at(0x224D);	// @ (0x449 * 8 + 5)
#define                                 NCO2ACC13_bit       _BIT_ACCESS(NCO2ACCH,5)
// NCO2ACCH<NCO2ACC14>
extern volatile __bit                   NCO2ACC14           __at(0x224E);	// @ (0x449 * 8 + 6)
#define                                 NCO2ACC14_bit       _BIT_ACCESS(NCO2ACCH,6)
// NCO2ACCH<NCO2ACC15>
extern volatile __bit                   NCO2ACC15           __at(0x224F);	// @ (0x449 * 8 + 7)
#define                                 NCO2ACC15_bit       _BIT_ACCESS(NCO2ACCH,7)
// NCO2ACCU<NCO2ACC16>
extern volatile __bit                   NCO2ACC16           __at(0x2250);	// @ (0x44A * 8 + 0)
#define                                 NCO2ACC16_bit       _BIT_ACCESS(NCO2ACCU,0)
// NCO2ACCU<NCO2ACC17>
extern volatile __bit                   NCO2ACC17           __at(0x2251);	// @ (0x44A * 8 + 1)
#define                                 NCO2ACC17_bit       _BIT_ACCESS(NCO2ACCU,1)
// NCO2ACCU<NCO2ACC18>
extern volatile __bit                   NCO2ACC18           __at(0x2252);	// @ (0x44A * 8 + 2)
#define                                 NCO2ACC18_bit       _BIT_ACCESS(NCO2ACCU,2)
// NCO2ACCU<NCO2ACC19>
extern volatile __bit                   NCO2ACC19           __at(0x2253);	// @ (0x44A * 8 + 3)
#define                                 NCO2ACC19_bit       _BIT_ACCESS(NCO2ACCU,3)
// NCO2ACCL<NCO2ACC2>
extern volatile __bit                   NCO2ACC2            __at(0x2242);	// @ (0x448 * 8 + 2)
#define                                 NCO2ACC2_bit        _BIT_ACCESS(NCO2ACCL,2)
// NCO2ACCL<NCO2ACC3>
extern volatile __bit                   NCO2ACC3            __at(0x2243);	// @ (0x448 * 8 + 3)
#define                                 NCO2ACC3_bit        _BIT_ACCESS(NCO2ACCL,3)
// NCO2ACCL<NCO2ACC4>
extern volatile __bit                   NCO2ACC4            __at(0x2244);	// @ (0x448 * 8 + 4)
#define                                 NCO2ACC4_bit        _BIT_ACCESS(NCO2ACCL,4)
// NCO2ACCL<NCO2ACC5>
extern volatile __bit                   NCO2ACC5            __at(0x2245);	// @ (0x448 * 8 + 5)
#define                                 NCO2ACC5_bit        _BIT_ACCESS(NCO2ACCL,5)
// NCO2ACCL<NCO2ACC6>
extern volatile __bit                   NCO2ACC6            __at(0x2246);	// @ (0x448 * 8 + 6)
#define                                 NCO2ACC6_bit        _BIT_ACCESS(NCO2ACCL,6)
// NCO2ACCL<NCO2ACC7>
extern volatile __bit                   NCO2ACC7            __at(0x2247);	// @ (0x448 * 8 + 7)
#define                                 NCO2ACC7_bit        _BIT_ACCESS(NCO2ACCL,7)
// NCO2ACCH<NCO2ACC8>
extern volatile __bit                   NCO2ACC8            __at(0x2248);	// @ (0x449 * 8 + 0)
#define                                 NCO2ACC8_bit        _BIT_ACCESS(NCO2ACCH,0)
// NCO2ACCH<NCO2ACC9>
extern volatile __bit                   NCO2ACC9            __at(0x2249);	// @ (0x449 * 8 + 1)
#define                                 NCO2ACC9_bit        _BIT_ACCESS(NCO2ACCH,1)
// NCO2CLK<NCO2CKS0>
extern volatile __bit                   NCO2CKS0            __at(0x2278);	// @ (0x44F * 8 + 0)
#define                                 NCO2CKS0_bit        _BIT_ACCESS(NCO2CLK,0)
// NCO2CLK<NCO2CKS1>
extern volatile __bit                   NCO2CKS1            __at(0x2279);	// @ (0x44F * 8 + 1)
#define                                 NCO2CKS1_bit        _BIT_ACCESS(NCO2CLK,1)
// NCO2CLK<NCO2CKS2>
extern volatile __bit                   NCO2CKS2            __at(0x227A);	// @ (0x44F * 8 + 2)
#define                                 NCO2CKS2_bit        _BIT_ACCESS(NCO2CLK,2)
// NCO2CLK<NCO2CKS3>
extern volatile __bit                   NCO2CKS3            __at(0x227B);	// @ (0x44F * 8 + 3)
#define                                 NCO2CKS3_bit        _BIT_ACCESS(NCO2CLK,3)
// NCO2CLK<NCO2CKS4>
extern volatile __bit                   NCO2CKS4            __at(0x227C);	// @ (0x44F * 8 + 4)
#define                                 NCO2CKS4_bit        _BIT_ACCESS(NCO2CLK,4)
// NCO2CON<NCO2EN>
extern volatile __bit                   NCO2EN              __at(0x2277);	// @ (0x44E * 8 + 7)
#define                                 NCO2EN_bit          _BIT_ACCESS(NCO2CON,7)
// PIE10<NCO2IE>
extern volatile __bit                   NCO2IE              __at(0x2543);	// @ (0x4A8 * 8 + 3)
#define                                 NCO2IE_bit          _BIT_ACCESS(PIE10,3)
// PIR10<NCO2IF>
extern volatile __bit                   NCO2IF              __at(0x25C3);	// @ (0x4B8 * 8 + 3)
#define                                 NCO2IF_bit          _BIT_ACCESS(PIR10,3)
// NCO2INCL<NCO2INC0>
extern volatile __bit                   NCO2INC0            __at(0x2258);	// @ (0x44B * 8 + 0)
#define                                 NCO2INC0_bit        _BIT_ACCESS(NCO2INCL,0)
// NCO2INCL<NCO2INC1>
extern volatile __bit                   NCO2INC1            __at(0x2259);	// @ (0x44B * 8 + 1)
#define                                 NCO2INC1_bit        _BIT_ACCESS(NCO2INCL,1)
// NCO2INCH<NCO2INC10>
extern volatile __bit                   NCO2INC10           __at(0x2262);	// @ (0x44C * 8 + 2)
#define                                 NCO2INC10_bit       _BIT_ACCESS(NCO2INCH,2)
// NCO2INCH<NCO2INC11>
extern volatile __bit                   NCO2INC11           __at(0x2263);	// @ (0x44C * 8 + 3)
#define                                 NCO2INC11_bit       _BIT_ACCESS(NCO2INCH,3)
// NCO2INCH<NCO2INC12>
extern volatile __bit                   NCO2INC12           __at(0x2264);	// @ (0x44C * 8 + 4)
#define                                 NCO2INC12_bit       _BIT_ACCESS(NCO2INCH,4)
// NCO2INCH<NCO2INC13>
extern volatile __bit                   NCO2INC13           __at(0x2265);	// @ (0x44C * 8 + 5)
#define                                 NCO2INC13_bit       _BIT_ACCESS(NCO2INCH,5)
// NCO2INCH<NCO2INC14>
extern volatile __bit                   NCO2INC14           __at(0x2266);	// @ (0x44C * 8 + 6)
#define                                 NCO2INC14_bit       _BIT_ACCESS(NCO2INCH,6)
// NCO2INCH<NCO2INC15>
extern volatile __bit                   NCO2INC15           __at(0x2267);	// @ (0x44C * 8 + 7)
#define                                 NCO2INC15_bit       _BIT_ACCESS(NCO2INCH,7)
// NCO2INCU<NCO2INC16>
extern volatile __bit                   NCO2INC16           __at(0x2268);	// @ (0x44D * 8 + 0)
#define                                 NCO2INC16_bit       _BIT_ACCESS(NCO2INCU,0)
// NCO2INCU<NCO2INC17>
extern volatile __bit                   NCO2INC17           __at(0x2269);	// @ (0x44D * 8 + 1)
#define                                 NCO2INC17_bit       _BIT_ACCESS(NCO2INCU,1)
// NCO2INCU<NCO2INC18>
extern volatile __bit                   NCO2INC18           __at(0x226A);	// @ (0x44D * 8 + 2)
#define                                 NCO2INC18_bit       _BIT_ACCESS(NCO2INCU,2)
// NCO2INCU<NCO2INC19>
extern volatile __bit                   NCO2INC19           __at(0x226B);	// @ (0x44D * 8 + 3)
#define                                 NCO2INC19_bit       _BIT_ACCESS(NCO2INCU,3)
// NCO2INCL<NCO2INC2>
extern volatile __bit                   NCO2INC2            __at(0x225A);	// @ (0x44B * 8 + 2)
#define                                 NCO2INC2_bit        _BIT_ACCESS(NCO2INCL,2)
// NCO2INCL<NCO2INC3>
extern volatile __bit                   NCO2INC3            __at(0x225B);	// @ (0x44B * 8 + 3)
#define                                 NCO2INC3_bit        _BIT_ACCESS(NCO2INCL,3)
// NCO2INCL<NCO2INC4>
extern volatile __bit                   NCO2INC4            __at(0x225C);	// @ (0x44B * 8 + 4)
#define                                 NCO2INC4_bit        _BIT_ACCESS(NCO2INCL,4)
// NCO2INCL<NCO2INC5>
extern volatile __bit                   NCO2INC5            __at(0x225D);	// @ (0x44B * 8 + 5)
#define                                 NCO2INC5_bit        _BIT_ACCESS(NCO2INCL,5)
// NCO2INCL<NCO2INC6>
extern volatile __bit                   NCO2INC6            __at(0x225E);	// @ (0x44B * 8 + 6)
#define                                 NCO2INC6_bit        _BIT_ACCESS(NCO2INCL,6)
// NCO2INCL<NCO2INC7>
extern volatile __bit                   NCO2INC7            __at(0x225F);	// @ (0x44B * 8 + 7)
#define                                 NCO2INC7_bit        _BIT_ACCESS(NCO2INCL,7)
// NCO2INCH<NCO2INC8>
extern volatile __bit                   NCO2INC8            __at(0x2260);	// @ (0x44C * 8 + 0)
#define                                 NCO2INC8_bit        _BIT_ACCESS(NCO2INCH,0)
// NCO2INCH<NCO2INC9>
extern volatile __bit                   NCO2INC9            __at(0x2261);	// @ (0x44C * 8 + 1)
#define                                 NCO2INC9_bit        _BIT_ACCESS(NCO2INCH,1)
// IPR10<NCO2IP>
extern volatile __bit                   NCO2IP              __at(0x1B63);	// @ (0x36C * 8 + 3)
#define                                 NCO2IP_bit          _BIT_ACCESS(IPR10,3)
// PMD4<NCO2MD>
extern volatile __bit                   NCO2MD              __at(0x321);	// @ (0x64 * 8 + 1)
#define                                 NCO2MD_bit          _BIT_ACCESS(PMD4,1)
// NCO2CON<NCO2OUT>
extern volatile __bit                   NCO2OUT             __at(0x2275);	// @ (0x44E * 8 + 5)
#define                                 NCO2OUT_bit         _BIT_ACCESS(NCO2CON,5)
// NCO2CON<NCO2PFM>
extern volatile __bit                   NCO2PFM             __at(0x2270);	// @ (0x44E * 8 + 0)
#define                                 NCO2PFM_bit         _BIT_ACCESS(NCO2CON,0)
// NCO2CON<NCO2POL>
extern volatile __bit                   NCO2POL             __at(0x2274);	// @ (0x44E * 8 + 4)
#define                                 NCO2POL_bit         _BIT_ACCESS(NCO2CON,4)
// NCO2CLK<NCO2PWS0>
extern volatile __bit                   NCO2PWS0            __at(0x227D);	// @ (0x44F * 8 + 5)
#define                                 NCO2PWS0_bit        _BIT_ACCESS(NCO2CLK,5)
// NCO2CLK<NCO2PWS1>
extern volatile __bit                   NCO2PWS1            __at(0x227E);	// @ (0x44F * 8 + 6)
#define                                 NCO2PWS1_bit        _BIT_ACCESS(NCO2CLK,6)
// NCO2CLK<NCO2PWS2>
extern volatile __bit                   NCO2PWS2            __at(0x227F);	// @ (0x44F * 8 + 7)
#define                                 NCO2PWS2_bit        _BIT_ACCESS(NCO2CLK,7)
// NCO3ACCL<NCO3ACC0>
extern volatile __bit                   NCO3ACC0            __at(0x2280);	// @ (0x450 * 8 + 0)
#define                                 NCO3ACC0_bit        _BIT_ACCESS(NCO3ACCL,0)
// NCO3ACCL<NCO3ACC1>
extern volatile __bit                   NCO3ACC1            __at(0x2281);	// @ (0x450 * 8 + 1)
#define                                 NCO3ACC1_bit        _BIT_ACCESS(NCO3ACCL,1)
// NCO3ACCH<NCO3ACC10>
extern volatile __bit                   NCO3ACC10           __at(0x228A);	// @ (0x451 * 8 + 2)
#define                                 NCO3ACC10_bit       _BIT_ACCESS(NCO3ACCH,2)
// NCO3ACCH<NCO3ACC11>
extern volatile __bit                   NCO3ACC11           __at(0x228B);	// @ (0x451 * 8 + 3)
#define                                 NCO3ACC11_bit       _BIT_ACCESS(NCO3ACCH,3)
// NCO3ACCH<NCO3ACC12>
extern volatile __bit                   NCO3ACC12           __at(0x228C);	// @ (0x451 * 8 + 4)
#define                                 NCO3ACC12_bit       _BIT_ACCESS(NCO3ACCH,4)
