GopalSaraf/Practicals/PSDL/include/proc/pic18f26q43.h
extern volatile __bit                   U5CTSPPS2           __at(0x13DA);	// @ (0x27B * 8 + 2)
#define                                 U5CTSPPS2_bit       _BIT_ACCESS(U5CTSPPS,2)
// U5CTSPPS<U5CTSPPS3>
extern volatile __bit                   U5CTSPPS3           __at(0x13DB);	// @ (0x27B * 8 + 3)
#define                                 U5CTSPPS3_bit       _BIT_ACCESS(U5CTSPPS,3)
// U5CTSPPS<U5CTSPPS4>
extern volatile __bit                   U5CTSPPS4           __at(0x13DC);	// @ (0x27B * 8 + 4)
#define                                 U5CTSPPS4_bit       _BIT_ACCESS(U5CTSPPS,4)
// U5CTSPPS<U5CTSPPS5>
extern volatile __bit                   U5CTSPPS5           __at(0x13DD);	// @ (0x27B * 8 + 5)
#define                                 U5CTSPPS5_bit       _BIT_ACCESS(U5CTSPPS,5)
// PIE13<U5EIE>
extern volatile __bit                   U5EIE               __at(0x255A);	// @ (0x4AB * 8 + 2)
#define                                 U5EIE_bit           _BIT_ACCESS(PIE13,2)
// PIR13<U5EIF>
extern volatile __bit                   U5EIF               __at(0x25DA);	// @ (0x4BB * 8 + 2)
#define                                 U5EIF_bit           _BIT_ACCESS(PIR13,2)
// IPR13<U5EIP>
extern volatile __bit                   U5EIP               __at(0x1B7A);	// @ (0x36F * 8 + 2)
#define                                 U5EIP_bit           _BIT_ACCESS(IPR13,2)
// U5ERRIE<U5FERIE>
extern volatile __bit                   U5FERIE             __at(0x17FB);	// @ (0x2FF * 8 + 3)
#define                                 U5FERIE_bit         _BIT_ACCESS(U5ERRIE,3)
// U5ERRIR<U5FERIF>
extern volatile __bit                   U5FERIF             __at(0x17F3);	// @ (0x2FE * 8 + 3)
#define                                 U5FERIF_bit         _BIT_ACCESS(U5ERRIR,3)
// U5CON2<U5FLO0>
extern volatile __bit                   U5FLO0              __at(0x17C8);	// @ (0x2F9 * 8 + 0)
#define                                 U5FLO0_bit          _BIT_ACCESS(U5CON2,0)
// U5CON2<U5FLO1>
extern volatile __bit                   U5FLO1              __at(0x17C9);	// @ (0x2F9 * 8 + 1)
#define                                 U5FLO1_bit          _BIT_ACCESS(U5CON2,1)
// PIE13<U5IE>
extern volatile __bit                   U5IE                __at(0x255B);	// @ (0x4AB * 8 + 3)
#define                                 U5IE_bit            _BIT_ACCESS(PIE13,3)
// PIR13<U5IF>
extern volatile __bit                   U5IF                __at(0x25DB);	// @ (0x4BB * 8 + 3)
#define                                 U5IF_bit            _BIT_ACCESS(PIR13,3)
// IPR13<U5IP>
extern volatile __bit                   U5IP                __at(0x1B7B);	// @ (0x36F * 8 + 3)
#define                                 U5IP_bit            _BIT_ACCESS(IPR13,3)
// PMD6<U5MD>
extern volatile __bit                   U5MD                __at(0x337);	// @ (0x66 * 8 + 7)
#define                                 U5MD_bit            _BIT_ACCESS(PMD6,7)
// U5CON0<U5MODE0>
extern volatile __bit                   U5MODE0             __at(0x17B8);	// @ (0x2F7 * 8 + 0)
#define                                 U5MODE0_bit         _BIT_ACCESS(U5CON0,0)
// U5CON0<U5MODE1>
extern volatile __bit                   U5MODE1             __at(0x17B9);	// @ (0x2F7 * 8 + 1)
#define                                 U5MODE1_bit         _BIT_ACCESS(U5CON0,1)
// U5CON0<U5MODE2>
extern volatile __bit                   U5MODE2             __at(0x17BA);	// @ (0x2F7 * 8 + 2)
#define                                 U5MODE2_bit         _BIT_ACCESS(U5CON0,2)
// U5CON1<U5ON>
extern volatile __bit                   U5ON                __at(0x17C7);	// @ (0x2F8 * 8 + 7)
#define                                 U5ON_bit            _BIT_ACCESS(U5CON1,7)
// U5ERRIE<U5PERIE>
extern volatile __bit                   U5PERIE             __at(0x17FE);	// @ (0x2FF * 8 + 6)
#define                                 U5PERIE_bit         _BIT_ACCESS(U5ERRIE,6)
// U5ERRIR<U5PERIF>
extern volatile __bit                   U5PERIF             __at(0x17F6);	// @ (0x2FE * 8 + 6)
#define                                 U5PERIF_bit         _BIT_ACCESS(U5ERRIR,6)
// U5FIFO<U5RCIDL>
extern volatile __bit                   U5RCIDL             __at(0x17E3);	// @ (0x2FC * 8 + 3)
#define                                 U5RCIDL_bit         _BIT_ACCESS(U5FIFO,3)
// U5CON2<U5RUNOVF>
extern volatile __bit                   U5RUNOVF            __at(0x17CF);	// @ (0x2F9 * 8 + 7)
#define                                 U5RUNOVF_bit        _BIT_ACCESS(U5CON2,7)
// U5FIFO<U5RXBE>
extern volatile __bit                   U5RXBE              __at(0x17E1);	// @ (0x2FC * 8 + 1)
#define                                 U5RXBE_bit          _BIT_ACCESS(U5FIFO,1)
// U5FIFO<U5RXBF>
extern volatile __bit                   U5RXBF              __at(0x17E0);	// @ (0x2FC * 8 + 0)
#define                                 U5RXBF_bit          _BIT_ACCESS(U5FIFO,0)
// U5CON1<U5RXBIMD>
extern volatile __bit                   U5RXBIMD            __at(0x17C3);	// @ (0x2F8 * 8 + 3)
#define                                 U5RXBIMD_bit        _BIT_ACCESS(U5CON1,3)
// U5ERRIE<U5RXBKIE>
extern volatile __bit                   U5RXBKIE            __at(0x17FA);	// @ (0x2FF * 8 + 2)
#define                                 U5RXBKIE_bit        _BIT_ACCESS(U5ERRIE,2)
// U5ERRIR<U5RXBKIF>
extern volatile __bit                   U5RXBKIF            __at(0x17F2);	// @ (0x2FE * 8 + 2)
#define                                 U5RXBKIF_bit        _BIT_ACCESS(U5ERRIR,2)
// U5CON0<U5RXEN>
extern volatile __bit                   U5RXEN              __at(0x17BC);	// @ (0x2F7 * 8 + 4)
#define                                 U5RXEN_bit          _BIT_ACCESS(U5CON0,4)
// U5ERRIE<U5RXFOIE>
extern volatile __bit                   U5RXFOIE            __at(0x17F9);	// @ (0x2FF * 8 + 1)
#define                                 U5RXFOIE_bit        _BIT_ACCESS(U5ERRIE,1)
// U5ERRIR<U5RXFOIF>
extern volatile __bit                   U5RXFOIF            __at(0x17F1);	// @ (0x2FE * 8 + 1)
#define                                 U5RXFOIF_bit        _BIT_ACCESS(U5ERRIR,1)
// U5FIFO<U5RXIDL>
extern volatile __bit                   U5RXIDL             __at(0x17E3);	// @ (0x2FC * 8 + 3)
#define                                 U5RXIDL_bit         _BIT_ACCESS(U5FIFO,3)
// PIE13<U5RXIE>
extern volatile __bit                   U5RXIE              __at(0x2558);	// @ (0x4AB * 8 + 0)
#define                                 U5RXIE_bit          _BIT_ACCESS(PIE13,0)
// PIR13<U5RXIF>
extern volatile __bit                   U5RXIF              __at(0x25D8);	// @ (0x4BB * 8 + 0)
#define                                 U5RXIF_bit          _BIT_ACCESS(PIR13,0)
// IPR13<U5RXIP>
extern volatile __bit                   U5RXIP              __at(0x1B78);	// @ (0x36F * 8 + 0)
#define                                 U5RXIP_bit          _BIT_ACCESS(IPR13,0)
// U5CON2<U5RXPOL>
extern volatile __bit                   U5RXPOL             __at(0x17CE);	// @ (0x2F9 * 8 + 6)
#define                                 U5RXPOL_bit         _BIT_ACCESS(U5CON2,6)
// U5RXPPS<U5RXPPS0>
extern volatile __bit                   U5RXPPS0            __at(0x13D0);	// @ (0x27A * 8 + 0)
#define                                 U5RXPPS0_bit        _BIT_ACCESS(U5RXPPS,0)
// U5RXPPS<U5RXPPS1>
extern volatile __bit                   U5RXPPS1            __at(0x13D1);	// @ (0x27A * 8 + 1)
#define                                 U5RXPPS1_bit        _BIT_ACCESS(U5RXPPS,1)
// U5RXPPS<U5RXPPS2>
extern volatile __bit                   U5RXPPS2            __at(0x13D2);	// @ (0x27A * 8 + 2)
#define                                 U5RXPPS2_bit        _BIT_ACCESS(U5RXPPS,2)
// U5RXPPS<U5RXPPS3>
extern volatile __bit                   U5RXPPS3            __at(0x13D3);	// @ (0x27A * 8 + 3)
#define                                 U5RXPPS3_bit        _BIT_ACCESS(U5RXPPS,3)
// U5RXPPS<U5RXPPS4>
extern volatile __bit                   U5RXPPS4            __at(0x13D4);	// @ (0x27A * 8 + 4)
#define                                 U5RXPPS4_bit        _BIT_ACCESS(U5RXPPS,4)
// U5RXPPS<U5RXPPS5>
extern volatile __bit                   U5RXPPS5            __at(0x13D5);	// @ (0x27A * 8 + 5)
#define                                 U5RXPPS5_bit        _BIT_ACCESS(U5RXPPS,5)
// U5CON1<U5SENDB>
extern volatile __bit                   U5SENDB             __at(0x17C0);	// @ (0x2F8 * 8 + 0)
#define                                 U5SENDB_bit         _BIT_ACCESS(U5CON1,0)
// U5CON2<U5STP0>
extern volatile __bit                   U5STP0              __at(0x17CC);	// @ (0x2F9 * 8 + 4)
#define                                 U5STP0_bit          _BIT_ACCESS(U5CON2,4)
// U5CON2<U5STP1>
extern volatile __bit                   U5STP1              __at(0x17CD);	// @ (0x2F9 * 8 + 5)
#define                                 U5STP1_bit          _BIT_ACCESS(U5CON2,5)
// U5FIFO<U5STPMD>
extern volatile __bit                   U5STPMD             __at(0x17E6);	// @ (0x2FC * 8 + 6)
#define                                 U5STPMD_bit         _BIT_ACCESS(U5FIFO,6)
// U5FIFO<U5TXBE>
extern volatile __bit                   U5TXBE              __at(0x17E5);	// @ (0x2FC * 8 + 5)
#define                                 U5TXBE_bit          _BIT_ACCESS(U5FIFO,5)
// U5FIFO<U5TXBF>
extern volatile __bit                   U5TXBF              __at(0x17E4);	// @ (0x2FC * 8 + 4)
#define                                 U5TXBF_bit          _BIT_ACCESS(U5FIFO,4)
// U5ERRIE<U5TXCIE>
extern volatile __bit                   U5TXCIE             __at(0x17F8);	// @ (0x2FF * 8 + 0)
#define                                 U5TXCIE_bit         _BIT_ACCESS(U5ERRIE,0)
// U5ERRIR<U5TXCIF>
extern volatile __bit                   U5TXCIF             __at(0x17F0);	// @ (0x2FE * 8 + 0)
#define                                 U5TXCIF_bit         _BIT_ACCESS(U5ERRIR,0)
// U5CON0<U5TXEN>
extern volatile __bit                   U5TXEN              __at(0x17BD);	// @ (0x2F7 * 8 + 5)
#define                                 U5TXEN_bit          _BIT_ACCESS(U5CON0,5)
// PIE13<U5TXIE>
extern volatile __bit                   U5TXIE              __at(0x2559);	// @ (0x4AB * 8 + 1)
#define                                 U5TXIE_bit          _BIT_ACCESS(PIE13,1)
// PIR13<U5TXIF>
extern volatile __bit                   U5TXIF              __at(0x25D9);	// @ (0x4BB * 8 + 1)
#define                                 U5TXIF_bit          _BIT_ACCESS(PIR13,1)
// IPR13<U5TXIP>
extern volatile __bit                   U5TXIP              __at(0x1B79);	// @ (0x36F * 8 + 1)
#define                                 U5TXIP_bit          _BIT_ACCESS(IPR13,1)
// U5ERRIE<U5TXMTIE>
extern volatile __bit                   U5TXMTIE            __at(0x17FF);	// @ (0x2FF * 8 + 7)
#define                                 U5TXMTIE_bit        _BIT_ACCESS(U5ERRIE,7)
// U5ERRIR<U5TXMTIF>
extern volatile __bit                   U5TXMTIF            __at(0x17F7);	// @ (0x2FE * 8 + 7)
#define                                 U5TXMTIF_bit        _BIT_ACCESS(U5ERRIR,7)
// U5CON2<U5TXPOL>
extern volatile __bit                   U5TXPOL             __at(0x17CA);	// @ (0x2F9 * 8 + 2)
#define                                 U5TXPOL_bit         _BIT_ACCESS(U5CON2,2)
// U5FIFO<U5TXWRE>
extern volatile __bit                   U5TXWRE             __at(0x17E7);	// @ (0x2FC * 8 + 7)
#define                                 U5TXWRE_bit         _BIT_ACCESS(U5FIFO,7)
// U5CON1<U5WUE>
extern volatile __bit                   U5WUE               __at(0x17C4);	// @ (0x2F8 * 8 + 4)
#define                                 U5WUE_bit           _BIT_ACCESS(U5CON1,4)
// U5UIR<U5WUIF>
extern volatile __bit                   U5WUIF              __at(0x17EF);	// @ (0x2FD * 8 + 7)
#define                                 U5WUIF_bit          _BIT_ACCESS(U5UIR,7)
// U5FIFO<U5XON>
extern volatile __bit                   U5XON               __at(0x17E2);	// @ (0x2FC * 8 + 2)
#define                                 U5XON_bit           _BIT_ACCESS(U5FIFO,2)
// ACTCON<UD>
extern volatile __bit                   UD                  __at(0x566);	// @ (0xAC * 8 + 6)
#define                                 UD_bit              _BIT_ACCESS(ACTCON,6)
// ADUTHL<UTH0>
extern volatile __bit                   UTH0                __at(0x1ED8);	// @ (0x3DB * 8 + 0)
#define                                 UTH0_bit            _BIT_ACCESS(ADUTHL,0)
// ADUTHL<UTH1>
extern volatile __bit                   UTH1                __at(0x1ED9);	// @ (0x3DB * 8 + 1)
#define                                 UTH1_bit            _BIT_ACCESS(ADUTHL,1)
// ADUTHH<UTH10>
extern volatile __bit                   UTH10               __at(0x1EE2);	// @ (0x3DC * 8 + 2)
#define                                 UTH10_bit           _BIT_ACCESS(ADUTHH,2)
// ADUTHH<UTH11>
extern volatile __bit                   UTH11               __at(0x1EE3);	// @ (0x3DC * 8 + 3)
#define                                 UTH11_bit           _BIT_ACCESS(ADUTHH,3)
// ADUTHH<UTH12>
extern volatile __bit                   UTH12               __at(0x1EE4);	// @ (0x3DC * 8 + 4)
#define                                 UTH12_bit           _BIT_ACCESS(ADUTHH,4)
// ADUTHH<UTH13>
extern volatile __bit                   UTH13               __at(0x1EE5);	// @ (0x3DC * 8 + 5)
#define                                 UTH13_bit           _BIT_ACCESS(ADUTHH,5)
// ADUTHH<UTH14>
extern volatile __bit                   UTH14               __at(0x1EE6);	// @ (0x3DC * 8 + 6)
#define                                 UTH14_bit           _BIT_ACCESS(ADUTHH,6)
// ADUTHH<UTH15>
extern volatile __bit                   UTH15               __at(0x1EE7);	// @ (0x3DC * 8 + 7)
#define                                 UTH15_bit           _BIT_ACCESS(ADUTHH,7)
// ADUTHL<UTH2>
extern volatile __bit                   UTH2                __at(0x1EDA);	// @ (0x3DB * 8 + 2)
#define                                 UTH2_bit            _BIT_ACCESS(ADUTHL,2)
// ADUTHL<UTH3>
extern volatile __bit                   UTH3                __at(0x1EDB);	// @ (0x3DB * 8 + 3)
#define                                 UTH3_bit            _BIT_ACCESS(ADUTHL,3)
// ADUTHL<UTH4>
extern volatile __bit                   UTH4                __at(0x1EDC);	// @ (0x3DB * 8 + 4)
#define                                 UTH4_bit            _BIT_ACCESS(ADUTHL,4)
// ADUTHL<UTH5>
extern volatile __bit                   UTH5                __at(0x1EDD);	// @ (0x3DB * 8 + 5)
#define                                 UTH5_bit            _BIT_ACCESS(ADUTHL,5)
// ADUTHL<UTH6>
extern volatile __bit                   UTH6                __at(0x1EDE);	// @ (0x3DB * 8 + 6)
#define                                 UTH6_bit            _BIT_ACCESS(ADUTHL,6)
// ADUTHL<UTH7>
extern volatile __bit                   UTH7                __at(0x1EDF);	// @ (0x3DB * 8 + 7)
#define                                 UTH7_bit            _BIT_ACCESS(ADUTHL,7)
// ADUTHH<UTH8>
extern volatile __bit                   UTH8                __at(0x1EE0);	// @ (0x3DC * 8 + 0)
#define                                 UTH8_bit            _BIT_ACCESS(ADUTHH,0)
// ADUTHH<UTH9>
extern volatile __bit                   UTH9                __at(0x1EE1);	// @ (0x3DC * 8 + 1)
#define                                 UTH9_bit            _BIT_ACCESS(ADUTHH,1)
// ADSTAT<UTHR>
extern volatile __bit                   UTHR                __at(0x1FBE);	// @ (0x3F7 * 8 + 6)
#define                                 UTHR_bit            _BIT_ACCESS(ADSTAT,6)
// VREGCON<VREGPM0>
extern volatile __bit                   VREGPM0             __at(0x240);	// @ (0x48 * 8 + 0)
#define                                 VREGPM0_bit         _BIT_ACCESS(VREGCON,0)
// VREGCON<VREGPM1>
extern volatile __bit                   VREGPM1             __at(0x241);	// @ (0x48 * 8 + 1)
#define                                 VREGPM1_bit         _BIT_ACCESS(VREGCON,1)
// WDTCON1<WDTCS0>
extern volatile __bit                   WDTCS0              __at(0x3CC);	// @ (0x79 * 8 + 4)
#define                                 WDTCS0_bit          _BIT_ACCESS(WDTCON1,4)
// WDTCON1<WDTCS1>
extern volatile __bit                   WDTCS1              __at(0x3CD);	// @ (0x79 * 8 + 5)
#define                                 WDTCS1_bit          _BIT_ACCESS(WDTCON1,5)
// WDTCON1<WDTCS2>
extern volatile __bit                   WDTCS2              __at(0x3CE);	// @ (0x79 * 8 + 6)
#define                                 WDTCS2_bit          _BIT_ACCESS(WDTCON1,6)
// WDTCON0<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x3C1);	// @ (0x78 * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON0,1)
// WDTCON0<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x3C2);	// @ (0x78 * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON0,2)
// WDTCON0<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x3C3);	// @ (0x78 * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON0,3)
// WDTCON0<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0x3C4);	// @ (0x78 * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON0,4)
// WDTCON0<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0x3C5);	// @ (0x78 * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON0,5)
// WDTTMR<WDTPSCNT16>
extern volatile __bit                   WDTPSCNT16          __at(0x3E0);	// @ (0x7C * 8 + 0)
#define                                 WDTPSCNT16_bit      _BIT_ACCESS(WDTTMR,0)
// WDTTMR<WDTPSCNT17>
extern volatile __bit                   WDTPSCNT17          __at(0x3E1);	// @ (0x7C * 8 + 1)
#define                                 WDTPSCNT17_bit      _BIT_ACCESS(WDTTMR,1)
// WDTCON0<WDTSEN>
extern volatile __bit                   WDTSEN              __at(0x3C0);	// @ (0x78 * 8 + 0)
#define                                 WDTSEN_bit          _BIT_ACCESS(WDTCON0,0)
// WDTTMR<WDTSTATE>
extern volatile __bit                   WDTSTATE            __at(0x3E2);	// @ (0x7C * 8 + 2)
#define                                 WDTSTATE_bit        _BIT_ACCESS(WDTTMR,2)
// WDTTMR<WDTTMR0>
extern volatile __bit                   WDTTMR0             __at(0x3E3);	// @ (0x7C * 8 + 3)
#define                                 WDTTMR0_bit         _BIT_ACCESS(WDTTMR,3)
// WDTTMR<WDTTMR1>
extern volatile __bit                   WDTTMR1             __at(0x3E4);	// @ (0x7C * 8 + 4)
#define                                 WDTTMR1_bit         _BIT_ACCESS(WDTTMR,4)
// WDTTMR<WDTTMR2>
extern volatile __bit                   WDTTMR2             __at(0x3E5);	// @ (0x7C * 8 + 5)
#define                                 WDTTMR2_bit         _BIT_ACCESS(WDTTMR,5)
// WDTTMR<WDTTMR3>
extern volatile __bit                   WDTTMR3             __at(0x3E6);	// @ (0x7C * 8 + 6)
#define                                 WDTTMR3_bit         _BIT_ACCESS(WDTTMR,6)
// WDTTMR<WDTTMR4>
extern volatile __bit                   WDTTMR4             __at(0x3E7);	// @ (0x7C * 8 + 7)
#define                                 WDTTMR4_bit         _BIT_ACCESS(WDTTMR,7)
// WDTCON1<WDTWINDOW0>
extern volatile __bit                   WDTWINDOW0          __at(0x3C8);	// @ (0x79 * 8 + 0)
#define                                 WDTWINDOW0_bit      _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WDTWINDOW1>
extern volatile __bit                   WDTWINDOW1          __at(0x3C9);	// @ (0x79 * 8 + 1)
#define                                 WDTWINDOW1_bit      _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WDTWINDOW2>
extern volatile __bit                   WDTWINDOW2          __at(0x3CA);	// @ (0x79 * 8 + 2)
#define                                 WDTWINDOW2_bit      _BIT_ACCESS(WDTCON1,2)
// PCON0<WDTWV>
extern volatile __bit                   WDTWV               __at(0x2785);	// @ (0x4F0 * 8 + 5)
#define                                 WDTWV_bit           _BIT_ACCESS(PCON0,5)
// WDTCON1<WINDOW0>
extern volatile __bit                   WINDOW0             __at(0x3C8);	// @ (0x79 * 8 + 0)
#define                                 WINDOW0_bit         _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WINDOW1>
extern volatile __bit                   WINDOW1             __at(0x3C9);	// @ (0x79 * 8 + 1)
#define                                 WINDOW1_bit         _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WINDOW2>
extern volatile __bit                   WINDOW2             __at(0x3CA);	// @ (0x79 * 8 + 2)
#define                                 WINDOW2_bit         _BIT_ACCESS(WDTCON1,2)
// SMT1CON0<WPOL>
extern volatile __bit                   WPOL                __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 WPOL_bit            _BIT_ACCESS(SMT1CON0,4)
// WPUA<WPUA0>
extern volatile __bit                   WPUA0               __at(0x2008);	// @ (0x401 * 8 + 0)
#define                                 WPUA0_bit           _BIT_ACCESS(WPUA,0)
// WPUA<WPUA1>
extern volatile __bit                   WPUA1               __at(0x2009);	// @ (0x401 * 8 + 1)
#define                                 WPUA1_bit           _BIT_ACCESS(WPUA,1)
// WPUA<WPUA2>
extern volatile __bit                   WPUA2               __at(0x200A);	// @ (0x401 * 8 + 2)
#define                                 WPUA2_bit           _BIT_ACCESS(WPUA,2)
// WPUA<WPUA3>
extern volatile __bit                   WPUA3               __at(0x200B);	// @ (0x401 * 8 + 3)
#define                                 WPUA3_bit           _BIT_ACCESS(WPUA,3)
// WPUA<WPUA4>
extern volatile __bit                   WPUA4               __at(0x200C);	// @ (0x401 * 8 + 4)
#define                                 WPUA4_bit           _BIT_ACCESS(WPUA,4)
// WPUA<WPUA5>
extern volatile __bit                   WPUA5               __at(0x200D);	// @ (0x401 * 8 + 5)
#define                                 WPUA5_bit           _BIT_ACCESS(WPUA,5)
// WPUA<WPUA6>
extern volatile __bit                   WPUA6               __at(0x200E);	// @ (0x401 * 8 + 6)
#define                                 WPUA6_bit           _BIT_ACCESS(WPUA,6)
// WPUA<WPUA7>
extern volatile __bit                   WPUA7               __at(0x200F);	// @ (0x401 * 8 + 7)
#define                                 WPUA7_bit           _BIT_ACCESS(WPUA,7)
// WPUB<WPUB0>
extern volatile __bit                   WPUB0               __at(0x2048);	// @ (0x409 * 8 + 0)
#define                                 WPUB0_bit           _BIT_ACCESS(WPUB,0)
// WPUB<WPUB1>
extern volatile __bit                   WPUB1               __at(0x2049);	// @ (0x409 * 8 + 1)
#define                                 WPUB1_bit           _BIT_ACCESS(WPUB,1)
// WPUB<WPUB2>
extern volatile __bit                   WPUB2               __at(0x204A);	// @ (0x409 * 8 + 2)
#define                                 WPUB2_bit           _BIT_ACCESS(WPUB,2)
// WPUB<WPUB3>
extern volatile __bit                   WPUB3               __at(0x204B);	// @ (0x409 * 8 + 3)
#define                                 WPUB3_bit           _BIT_ACCESS(WPUB,3)
// WPUB<WPUB4>
extern volatile __bit                   WPUB4               __at(0x204C);	// @ (0x409 * 8 + 4)
#define                                 WPUB4_bit           _BIT_ACCESS(WPUB,4)
// WPUB<WPUB5>
extern volatile __bit                   WPUB5               __at(0x204D);	// @ (0x409 * 8 + 5)
#define                                 WPUB5_bit           _BIT_ACCESS(WPUB,5)
// WPUB<WPUB6>
extern volatile __bit                   WPUB6               __at(0x204E);	// @ (0x409 * 8 + 6)
#define                                 WPUB6_bit           _BIT_ACCESS(WPUB,6)
// WPUB<WPUB7>
extern volatile __bit                   WPUB7               __at(0x204F);	// @ (0x409 * 8 + 7)
#define                                 WPUB7_bit           _BIT_ACCESS(WPUB,7)
// WPUC<WPUC0>
extern volatile __bit                   WPUC0               __at(0x2088);	// @ (0x411 * 8 + 0)
#define                                 WPUC0_bit           _BIT_ACCESS(WPUC,0)
// WPUC<WPUC1>
